In [103]:
%config InlineBackend.figure_formats = ['svg']
from numpy.random import randint
import numpy as np # for importing numpy
import pandas as pd # for importing pandas

import seaborn as sns # seaborn is used to plot
from matplotlib.animation import ArtistAnimation
import random
import os

In [104]:

from scipy import stats

In [105]:
data = pd.DataFrame({'salaries':[33219, 36254, 38801, 46335, 46840,47596, 55130, 56863, 78070, 88830]})

In [106]:
# get all using pandas for poblational data

In [107]:
pop_var = data['salaries'].var(ddof=0)
sam_var = data['salaries'].var(ddof=1)
# n - ddof
# 49

In [108]:
print(pop_var, sam_var)

291622740.36 324025267.06666666

In [109]:
# get the sample standard deviation and the population standard deviation
pop_std = data['salaries'].std(ddof=0)
sam_std = data['salaries'].std(ddof=1)

In [110]:
print(pop_std, sam_std)

17076.965197598784 18000.70184927984

In [111]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 1 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   salaries  10 non-null     int64
dtypes: int64(1)
memory usage: 208.0 bytes

In [112]:
# now get all the values manually

In [113]:
# mean
n =  len(data)
sm = 0
for i in range(n):
	sm += data['salaries'][i]

pop_mean = sm/n
sam_mean = pop_mean

In [114]:
pop_mean, sam_mean

(52793.8, 52793.8)

In [115]:
sq_diff = 0
for i in range(n):
	sq_diff += (data['salaries'][i] - pop_mean) ** 2

pop_var = sq_diff/n
sam_var = sq_diff/(n-1)

In [116]:
pop_std = pop_var ** 0.5
sam_std = sam_var ** 0.5

In [117]:
pop_std, sam_std

(17076.965197598784, 18000.70184927984)

In [118]:
mu = 5 
std = 2

In [119]:
array = stats.norm.rvs(size=10, loc = mu, scale = std)

In [120]:
array[:10]

array([ 7.78749919,  7.52884374,  6.47317043,  5.25060601,  9.09285156,
        6.52565016,  3.89668145,  5.90416194, 10.1991209 ,  4.78202866])

In [121]:
array.mean(), array.std(ddof = 1)

(6.744061404324654, 1.9485883126551433)

In [122]:
df = pd.DataFrame({'salaries':array})

In [123]:
df.apply(lambda x: x.quantile(0.75) - x.quantile(0.25))

salaries    2.30884
dtype: float64

In [124]:
data = pd.read_csv('data/klout-scores.csv', header = None, names = ['scores'])
data.head()

      scores
0  25.104179
1  60.908747
2  23.222238
3  51.553491
4  22.629690

In [125]:
n = data.scores.count()

confidence_coef = 0.95

alpha = 1. - confidence_coef

# an easier way to get critacal value scipy.stats
# interval function, The alpha .95 being a little bit different from the alpha 0.05

zscore_interval = stats.norm.interval(confidence_coef)

In [126]:
zscore_interval

(-1.959963984540054, 1.959963984540054)

In [127]:
mu = 5
std = 2

In [128]:
mu = 5
std = 2 
y = stats.norm.rvs(mu, std, size=1000)

In [129]:
y.mean(), y.std(ddof=0), y.std(ddof=1)

(5.035829731677526, 2.017914918551852, 2.018924633360373)

In [130]:
x = np.random.normal(mu, std, size = 100)

In [131]:
x.mean(), x.std(ddof=0), x.std(ddof=1)

(4.905693341098335, 2.1867513796897975, 2.1977678291585017)

In [132]:
df = pd.DataFrame({'salaries':x})

df['salaries'].quantile(0.75) - df['salaries'].quantile(0.25)

3.0631977752241935

In [133]:
df.apply(lambda x: x.quantile(0.75) - x.quantile(0.25))

salaries    3.063198
dtype: float64

In [134]:
# Create a set with an obvious non-normal distribution
data = pd.Series([1,1,0,1,2,2,3,2,1,3,3,2,8,2,1,6,2,1,1,2,2,1,3,2,1,
						2,3,6,2,3,2,2,1,2,2,3,2,1,2,3,2,3,2,3,1,6,1,8,1,1])
data.describe()

count    50.000000
mean      2.340000
std       1.709637
min       0.000000
25%       1.000000
50%       2.000000
75%       3.000000
max       8.000000
dtype: float64

In [135]:
# the null hypothesis is that data was drawn from a normal distribution
# it returns non statistic and the probability that this statistic 
# came from a normal distribution ( p  value)
w, p = stats.shapiro(data)
w,p

(0.7413722276687622, 4.960041621870914e-08)

In [136]:
# test the null hypothesis with 5% alpha
alpha = 0.05
p > alpha

False

In [137]:

data = pd.DataFrame({'salaries':[33219, 36254, 38801, 46335, 46840,47596, 55130, 56863, 78070, 88830]})

In [138]:
n = len(data)

In [139]:
var, mean, std = 0,0,0

for i in range(n):
	mean += data['salaries'][i]

mean = mean/n

In [140]:
for i in range(n):
	var += (data['salaries'][i] - mean) ** 2

var = var / n
std = var ** 0.5

In [141]:
mean, var, std

(52793.8, 291622740.36, 17076.965197598784)

In [142]:
pmean, pvar, pstd = data['salaries'].mean(), data['salaries'].var(ddof=0), data['salaries'].std(ddof=0)

In [143]:

pmean, pvar, pstd

(52793.8, 291622740.36, 17076.965197598784)

In [144]:

# The data set contains the top 1000 baby names in the US
# for each year from 1880 until 2008
names_df = pd.read_csv('data/baby-names2.csv')
names_df.head()

   year     name      prop  sex soundex
0  1880     John  0.081541  boy    J500
1  1880  William  0.080511  boy    W450
2  1880    James  0.050057  boy    J520
3  1880  Charles  0.045167  boy    C642
4  1880   George  0.043292  boy    G620

In [145]:


# Load the original dataframe from csv
df = pd.read_csv('data/feature-engineering.csv')
df.head()

  Gender       City Attended     Value
0   girl   New York      Yes  0.991472
1    boy     London       No  0.980504
2    boy  Amsterdam      Yes  0.969145
3    boy  Amsterdam       No  0.968502
4    man     London      Yes  0.938684

In [146]:
from sklearn.preprocessing import OneHotEncoder
# do a binary one hot encoding for the Attended column
encoded = OneHotEncoder(sparse=False).fit_transform(df[['Attended']])

/home/rockhight/Documents/bosonit/files/data_science_exercises/venv/lib/python3.10/site-packages/sklearn/preprocessing/_encoders.py:808: FutureWarning: `sparse` was renamed to `sparse_output` in version 1.2 and will be removed in 1.4. `sparse_output` is ignored unless you leave `sparse` to its default value.
  warnings.warn(

In [147]:
encoded

array([[0., 1.],
       [1., 0.],
       [0., 1.],
       [1., 0.],
       [0., 1.],
       [1., 0.],
       [0., 1.],
       [1., 0.],
       [0., 1.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [1., 0.],
       [0., 1.],
       [0., 1.],
       [1., 0.],
       [1., 0.],
       [0., 1.],
       [1., 0.],
       [1., 0.],
       [0., 1.],
       [0., 1.],
       [1., 0.],
       [1., 0.],
       [0., 1.],
       [1., 0.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [0., 1.],
       [0., 1.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [0., 1.],
       [0., 1.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [0., 1.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [1., 0.],
       [0., 1.],
       [0., 1.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [0., 1.],
       [0., 1.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [0., 1.],
       [1., 0.],
       [0., 1.],
       [0., 1.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [0., 1.]])

In [148]:
df = pd.concat([df, pd.DataFrame(encoded, columns = ['Attended(yes)','Attended(no'])],axis = 1)

In [149]:
df.head()

  Gender       City Attended     Value  Attended(yes)  Attended(no
0   girl   New York      Yes  0.991472            0.0          1.0
1    boy     London       No  0.980504            1.0          0.0
2    boy  Amsterdam      Yes  0.969145            0.0          1.0
3    boy  Amsterdam       No  0.968502            1.0          0.0
4    man     London      Yes  0.938684            0.0          1.0

In [150]:
df.drop('Attended', axis=1, inplace=True)

In [151]:
df.head()

  Gender       City     Value  Attended(yes)  Attended(no
0   girl   New York  0.991472            0.0          1.0
1    boy     London  0.980504            1.0          0.0
2    boy  Amsterdam  0.969145            0.0          1.0
3    boy  Amsterdam  0.968502            1.0          0.0
4    man     London  0.938684            0.0          1.0